package ru.sapiapps.randomword

import android.os.Bundle
import androidx.activity.ComponentActivity
import ru.sapiapps.randomword.databinding.ActivityMainBinding
import android.os.CountDownTimer

class MainActivity : ComponentActivity() {
    private lateinit var binding: ActivityMainBinding

    // Переменная для таймера
    private var countDownTimer: CountDownTimer? = null

    // Запуск таймера
    private fun startTimer() {
        val timerTextView = binding.timerTextView // Ссылка на TextView для таймера

        // Отмена предыдущего таймера, если он запущен
        countDownTimer?.cancel()

        // Создаём новый таймер на 15 секунд (Поставлю +1 секунду, чтобы вначале отображалось 15)
        countDownTimer = object : CountDownTimer(16000, 1000) { // 15000 мс = 15 секунд
            override fun onTick(millisUntilFinished: Long) {
                // Обновляем текст таймера каждую секунду
                timerTextView.text = (millisUntilFinished / 1000).toString()
            }

            override fun onFinish() {
                // Когда таймер завершился
                timerTextView.text = "0"
            }
        }.start()
    }


    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)

        // Подключаем ViewBinding
        binding = ActivityMainBinding.inflate(layoutInflater)
        setContentView(binding.root)

        // Инициализация и работа с элементами
        val randomWordText = binding.randomWordText
        val generateWordButton = binding.generateWordButton

        // Списки слов
        val natureWords = mutableListOf(
            "абрикос", "август", "авокадо", "агава", "агат", "азот", "аист", "айсберг", "акация", "акула",
            "алкоголь", "аллея", "алмаз", "альбатрос", "альпака", "амбар", "амфибия", "ананас", "антарктида", "апрель",
            "арахис", "арбуз", "арктика", "бабочка", "баклажан", "бактерия", "бамбук", "банан", "баран", "барс",
            "батат", "белка", "белуга", "бензин", "берег", "беркут", "берлога", "берёза", "бетон", "бирюза",
            "бобр", "бобёр", "болото", "бор", "бриз", "бриллиант", "броненосец", "брусника", "буйвол", "бук",
            "букашка", "буревестник", "бык", "варан", "василёк", "век", "весна", "ветер", "ветка", "викунья",
            "вино", "виноград", "вихрь", "вода", "водород", "водоросль", "водоём", "волк", "вольфрам", "воробей",
            "ворон", "ворона", "восток", "восход", "всход", "вулкан", "выживание", "вьюга", "вьюн", "гагара",
            "газ", "гардения", "гвоздика", "геккон", "гепард", "гипс", "глаз", "глаза", "год", "голос",
            "голубика", "голубь", "гора", "горох", "град", "гранат", "графит", "гриб", "грибница", "грибок",
            "гром", "грунт", "груша", "грязь", "гумус", "гусеница", "гусь", "декабрь", "дельфин", "дерево",
            "джунгли", "дождь", "долгота", "дом", "дорога", "дуб", "дым", "дыня", "еда", "ежевика",
            "ель", "жаба", "жадеит", "жара", "жасмин", "жатва", "железо", "жемчуг", "животное", "жизнь",
            "жилище", "жильё", "жимолость", "жир", "жираф", "жук", "загон", "закат", "залив", "запад",
            "зарево", "заря", "заяц", "зверь", "звёзды", "зебра", "земля", "земноводное", "зима", "змея",
            "зной", "золото", "изумруд", "имбирь", "индейка", "индюк", "иней", "июль", "июнь", "кабан",
            "казуар", "кактус", "календула", "калина", "камень", "камнепад", "камыш", "капибара", "капля", "карп",
            "картофель", "каштан", "кварц", "кедр", "кенгуру", "кешью", "киви", "кислород", "кит", "китоглав",
            "клетка", "клубника", "клюква", "клён", "коала", "кожа", "коза", "козёл", "кокос", "комар",
            "конь", "коралл", "корень", "корова", "коряга", "кости", "кость", "костёр", "кот", "кочка",
            "кошка", "краб", "крапива", "креветка", "кремень", "кремний", "крик", "крокодил", "кролик", "крот",
            "крыжовник", "крыса", "кувшинка", "кузнечик", "кукушка", "курица", "куст", "кустарник", "кустраник", "лава",
            "лаванда", "лама", "ландыш", "лебедь", "лев", "ледник", "леопард", "лес", "лето", "лиана",
            "лилия", "липа", "лиса", "лисица", "лист", "лиственница", "листок", "листья", "лишай", "лосось",
            "лось", "лотос", "лошадь", "луг", "лужа", "лужайка", "лук", "луна", "лягушка", "лёд",
            "лён", "май", "мак", "малина", "мамонт", "манго", "мандарины", "маракуйя", "март", "масло",
            "мгла", "медведь", "медь", "мелодия", "месяц", "метель", "минерал", "мираж", "можжевельник", "мозг",
            "молния", "молодость", "молоко", "море", "морж", "морковь", "мороз", "морошка", "мотыга", "мох",
            "музыка", "мука", "муравей", "муха", "мышь", "мясо", "накидка", "напиток", "насекомое", "небо",
            "нервы", "нефрит", "нефть", "нос", "ночь", "ноябрь", "обезьяна", "облепиха", "обоняние", "овраг",
            "овца", "огонь", "огурец", "озеро", "океан", "олень", "оливка", "опал", "опасность", "орех",
            "орхидея", "орёл", "оса", "осень", "осина", "осока", "осьминог", "осётр", "отлив", "палатка",
            "палка", "пальма", "панда", "папайя", "парк", "паук", "паутина", "пеликан", "первобытный", "перегной",
            "перец", "перловка", "перо", "персик", "песня", "песок", "печень", "пещера", "пингвин", "пион",
            "пиранья", "пихта", "пища", "плавание", "пламя", "племя", "плесень", "плот", "плотина", "побережье",
            "погода", "подберёзовик", "подорожник", "подосиновик", "подсолнух", "пожар", "полнолуние", "полночь", "полынь", "поляна",
            "полёт", "поплавок", "попугай", "популяция", "поросль", "посох", "почва", "почки", "прибой", "прилив",
            "природа", "просо", "пруд", "птица", "пума", "пустыня", "пчела", "пшеница", "пшено", "пёс",
            "радуга", "радужка", "разлив", "ракушка", "рассвет", "растение", "редис", "река", "рис", "рождение",
            "рожь", "роза", "ромашка", "роса", "рубин", "рукола", "рыба", "рысь", "рябина", "саванна",
            "саженец", "сакура", "саламандра", "сапфир", "саранча", "сахар", "свет", "светило", "север", "седина",
            "село", "сельдерей", "семена", "семечки", "семечко", "семя", "сентябрь", "сердце", "серебро", "сеть",
            "сирень", "скат", "скворец", "скворечник", "скелет", "слива", "слух", "смородина", "снег", "снегирь",
            "снегопад", "снежинка", "собака", "сова", "сойка", "солнце", "соловей", "соль", "сорока", "сосна",
            "спрут", "старость", "стебель", "стекло", "степь", "стерлядь", "страус", "стружка", "сумерки", "суп",
            "сурок", "суслик", "сухожилие", "сыр", "тайга", "тайфун", "таракан", "тепло", "тигр", "тина",
            "томаты", "тополь", "топот", "торнадо", "трава", "тропа", "тростник", "труд", "трясина", "тукан",
            "туман", "тундра", "тунец", "тьма", "тюльпан", "углеводы", "углерод", "удило", "удобрение", "удочка",
            "ураган", "устье", "утка", "утёс", "ухо", "факел", "фасоль", "фауна", "филин", "фисташки",
            "фламинго", "флора", "фтор", "фундук", "хвоя", "хлопок", "холм", "холод", "хрусталь", "цапля",
            "цвет", "цветок", "цветы", "циклон", "цунами", "цыплёнок", "чайка", "чаща", "человек", "червь",
            "черемша", "череп", "черепаха", "черешня", "черника", "чеснок", "чешуя", "чистотел", "шалфей", "шампиньон",
            "шелкопряд", "шерсть", "широта", "шишка", "шмель", "шпинат", "шторм", "шёлк", "щавель", "щука",
            "эвкалипт", "эволюция", "эмбрион", "юг", "яблоко", "яблоня", "ягода", "яйцо", "яма", "январь",
            "янтарь", "ясень", "ястреб", "ячмень", "ящер", "ящерица", "ёж", "ёжик", "ёлка"
        )

        val socialWords = mutableListOf(
            "абсолют", "авторитет", "агент", "агрессия", "адвокат", "адекватность", "азбука", "азы", "аккаунт", "активность",
            "актриса", "актёр", "акция", "алфавит", "алхимик", "алхимия", "альбом", "альянс", "анализ", "ангел",
            "андроид", "аннигиляция", "антигравитация", "антиутопия", "апокалипсис", "аппарат", "арифметика", "армагеддон", "артефакт", "ассортимент",
            "астероид", "астрал", "астронавт", "атеизм", "аттестация", "аудитория", "бабушка", "баланс", "балет", "банк",
            "банкир", "барьер", "бездна", "безопасность", "беседа", "бесконечность", "бессмертие", "бизнес", "биомеханизм", "благо",
            "благодарность", "благотворительность", "близость", "богатство", "боцман", "брак", "брат", "буддизм", "буква", "бумага",
            "бумаги", "бюджет", "вакуум", "вампир", "вдохновение", "ведьма", "вера", "вечность", "взаимность", "взаимовыручка",
            "взаимодействие", "взаимопомощь", "взаимопонимание", "взаимосвязь", "взвешенность", "взгляды", "взрослый", "виртуальный", "владелец", "владение",
            "влияние", "внимание", "внимательность", "внук", "возлюбленная", "возлюбленный", "возможность", "возмущение", "возрождение", "война",
            "войско", "волнение", "волшебник", "волшебство", "воля", "воодушевление", "воспоминание", "восстановление", "востребованность", "восхищение",
            "враг", "врач", "вред", "вселенная", "встреча", "выбор", "выгода", "выражение", "галактика", "гарантия",
            "гармония", "генерал", "гибрид", "гидра", "гипердвигатель", "гиперкуб", "гиперпространство", "гиперреальность", "гипноз", "глобализация",
            "глобус", "гном", "гоблин", "голем", "голограмма", "голод", "голос", "горгулья", "гордость", "горе",
            "город", "господин", "господство", "госпожа", "государство", "гравитация", "гравицаппа", "гражданство", "грим", "грифон",
            "группа", "грусть", "губернатор", "двигатель", "дворецкий", "дворф", "дедушка", "дезинтегратор", "дело", "демон",
            "деньги", "депрессия", "деятельность", "диалог", "диведенды", "диверсант", "диверсия", "дивиденд", "диктатор", "диктатура",
            "дипломат", "дипломатия", "дискуссия", "доблесть", "добро", "доброта", "доверие", "договор", "документ", "долг",
            "должность", "дом", "доминатор", "доспехи", "доставка", "достоинство", "доход", "дочь", "дракон", "друг",
            "дружба", "дружелюбие", "друзья", "дух", "душа", "душевность", "дядя", "еда", "единорог", "единство",
            "жена", "жертва", "жертвенность", "жнец", "забота", "завод", "завоеватель", "завтрак", "загадка", "заговор",
            "загс", "заказ", "заклинание", "закон", "законодательство", "замкнутость", "замок", "замысел", "заработок", "заслуга",
            "защита", "заявка", "заявление", "звезда", "звездолёт", "здравоохранение", "зелье", "зеркало", "зло", "злоба",
            "злость", "знакомство", "знание", "значение", "значимость", "золото", "идентификация", "извинение", "ии", "иллюзия",
            "имплант", "имущество", "инвестирование", "инвестиция", "инженер", "инициатива", "инновация", "инопланетянин", "иностранец", "интерес",
            "интуиция", "инфраструктура", "искренность", "историк", "история", "капитал", "капитан", "кардинал", "карма", "карьера",
            "квазар", "квант", "квантовый", "квартира", "киберпанк", "киборг", "кинематограф", "кино", "клиент", "клон",
            "клонирование", "клоун", "коллектив", "команда", "комета", "комиссия", "коммерция", "коммуникация", "компания", "компромисс",
            "комфорт", "консул", "консультант", "консультация", "контакт", "континуум", "контракт", "контроль", "конфликт", "кооператив",
            "кооперация", "корабль", "королева", "королевство", "король", "корона", "корпорация", "космический", "космос", "кредо",
            "крестьянин", "кристалл", "кротость", "круг", "кулинария", "культура", "кухня", "лазер", "левитация", "лидер",
            "лидерство", "лингвистика", "лицензия", "логика", "логистика", "лояльность", "лучник", "любитель", "любовь", "любопытство",
            "люди", "лётчик", "маг", "магия", "майор", "манипуляция", "маркетинг", "мастер", "матрица", "матрос",
            "мать", "мегаполис", "меланхолик", "меланхолия", "менеджмент", "метавселенная", "метафизика", "мидихлорианы", "милосердие", "мимик",
            "мир", "миротворец", "митохондрии", "мнение", "монарх", "монархия", "мониторинг", "монолит", "мотив", "мудрость",
            "муж", "музыка", "мультивселенная", "мультипаспорт", "мутант", "мысль", "мэр", "навык", "награда", "надежда",
            "налог", "налоги", "намерение", "наноботы", "народ", "наследие", "наследство", "наставник", "наука", "неведомое",
            "невидимость", "недвижимость", "недоброжелатель", "нежность", "независимость", "неземное", "нейроимплант", "нейрон", "нейросеть", "нейрошлем",
            "нейтрон", "некромант", "некромантия", "неуверенность", "нигилизм", "новичок", "нужда", "обед", "обещание", "облигация",
            "обмен", "оборотень", "образование", "обсерватория", "обсуждение", "общение", "общество", "объединение", "объект", "объятие",
            "объятия", "обязанности", "обязанность", "одежда", "озабоченность", "опека", "опера", "оператор", "опыт", "организация",
            "орден", "ориентир", "орк", "осознание", "отвага", "ответственность", "отдача", "отец", "отзыв", "откровенность",
            "открытость", "отношение", "отношения", "отрезвление", "отрицание", "отчаяние", "отчим", "оценка", "ощущение", "память",
            "парадокс", "параллельная", "партия", "партнёр", "переговоры", "переживание", "песчаный", "пилот", "пират", "писатель",
            "плазма", "планета", "платформа", "поддержание", "поддержка", "подруга", "подсчёт", "подтверждение", "пожелания", "пожертвование",
            "позиция", "поиск", "покой", "покорность", "покровитель", "покровительство", "поле", "политика", "польза", "помощь",
            "понимание", "портал", "поселенец", "поселение", "послушание", "постановка", "постановление", "поступок", "потомки", "потомок",
            "потустороннее", "правитель", "правнук", "право", "прадед", "преданность", "предки", "предок", "президент", "прибыль",
            "привидение", "привязанность", "приготовление", "призма", "признание", "призрак", "примирение", "принц", "принцесса", "принцип",
            "приоритет", "пристав", "пристрастие", "пробуждение", "прогресс", "продвижение", "продуманность", "проект", "производство", "прораб",
            "пророчество", "прорыв", "профессионал", "профессионализм", "прощение", "психика", "психолог", "психология", "публика", "публикация",
            "пустота", "путь", "раб", "рабочий", "рабыня", "равнодушие", "радость", "радушие", "разведчик", "развитие",
            "разговор", "разделение", "разобщённость", "разочарование", "разрешение", "разрозненность", "разрушение", "ракета", "распад", "расставание",
            "реактор", "реакция", "реализация", "ребёнок", "ревизия", "режиссёр", "резидент", "рейтинг", "религиозность", "религия",
            "репликатор", "республика", "ресурс", "ресурсы", "ретранслятор", "решение", "риск", "робот", "родные", "родственник",
            "рождение", "роль", "русалка", "рынок", "рыцарь", "самоотдача", "самореализация", "сангвиник", "свадьба", "сверхновая",
            "сверхскорость", "сверхъестественное", "световоймеч", "свобода", "связь", "сделка", "семья", "сентиментальность", "сервис", "сериал",
            "сестра", "сила", "симулякр", "симуляция", "сингулярность", "система", "сканер", "скидка", "слабость", "слуга",
            "служанка", "слушание", "смерть", "смех", "смирение", "снайпер", "совместимость", "согласие", "согласование", "соглашение",
            "сожаление", "созвездие", "созидание", "солдат", "сомнение", "сон", "сообщение", "сопереживание", "сопротивление", "сосредоточение",
            "состояние", "сострадание", "сотрудник", "сотрудничество", "сохранение", "социум", "сочувствие", "союз", "специалист", "сплочённость",
            "спокойствие", "спрос", "спутник", "средства", "стабильность", "стандарт", "стимпанк", "стоимость", "столица", "страдание",
            "страдания", "страна", "страсть", "стратегия", "страх", "стрелок", "стрельба", "стресс", "строитель", "стройка",
            "структура", "субсидия", "суд", "судья", "сфера", "сферадайсона", "счастье", "сын", "сюжет", "тактика",
            "тактичность", "тариф", "творчество", "театр", "телепортация", "тени", "теплота", "термодинамика", "терпимость", "терраформирование",
            "технологии", "технология", "тотем", "традиция", "трансформация", "тревога", "трезвость", "тренд", "тролль", "трусость",
            "туманность", "туризм", "тяготение", "тётя", "уважение", "увековечение", "угроза", "удовлетворение", "удовольствие", "ужин",
            "улыбка", "умиротворение", "управление", "уравновешенность", "услуга", "успех", "устойчивость", "уступка", "утопия", "уход",
            "уценка", "участие", "ученик", "учитель", "учёт", "факт", "фанат", "фанатик", "федерация", "феникс",
            "ферма", "фильм", "финансирование", "финансы", "фирма", "флегматик", "флуктуация", "фото", "фотография", "функция",
            "хаос", "хоббит", "хозяйство", "холерик", "хроника", "художник", "царь", "цели", "цель", "цена",
            "ценность", "центр", "цикл", "чародей", "человек", "человечность", "червоточина", "честность", "честь", "чувства",
            "чувствительность", "чувство", "шаг", "шанс", "швея", "шпион", "экзоскелет", "экономика", "экспансия", "эксперимент",
            "эксперт", "эликсир", "эльф", "эмоции", "эмоциональность", "эмоция", "эмпатия", "энергия", "энт", "энтропия",
            "этимология", "эфир", "эффективность", "юрист", "язык", "ясность"
        )

        val technologyWords = mutableListOf(
            "аксиома", "алгебра", "алгоритм", "алгоритмизация", "аминокислота", "анализ", "анализатор", "андроид", "антенна", "антивирус",
            "аппарат", "архив", "архиватор", "архитектура", "астероид", "астробиолог", "астроном", "астрономия", "астрофизик", "атмосфера",
            "атом", "база", "байт", "барометр", "белок", "бинокль", "биолог", "бит", "битрейт", "бозон",
            "браузер", "бронза", "веб", "вебсайт", "вентилятор", "вентиляция", "вертолёт", "вещество", "взлёт", "взрыв",
            "видео", "видеозапись", "видеокамера", "визуализация", "виртуальный", "вкладка", "водопровод", "вопрос", "время", "вселенная",
            "вход", "выплавка", "выстрел", "выход", "вычисления", "выявление", "выяснение", "гаджет", "газ", "галактика",
            "ген", "гены", "геометрия", "гипотеза", "гравитация", "график", "графика", "давление", "данные", "дедукция",
            "день", "детектор", "диаграмма", "дисплей", "доклад", "документ", "доступ", "драйвер", "дрон",
            "жидкость", "журнал", "зависимость", "загрязнение", "задача", "закон", "замораживание", "запись", "запуск", "защита",
            "звезда", "звук", "игра", "излучатель", "изменчивость", "измерение", "измеритель", "изображение", "изобретатель", "изобретение",
            "изучение", "ии", "инженер", "инсталляция", "интеллект", "интернет", "интерфейс", "интерферометр", "информатика", "информация",
            "исключение", "испарение", "исследование", "исследователь", "источник", "калькулятор", "камера", "карта", "катализатор", "каталог",
            "квадрат", "квант", "кислота", "клавиатура", "класс", "ключ", "книга", "ковка", "код", "кодировка",
            "колонизация", "колония", "колонка", "команда", "комета", "компас", "компиляция", "комплекс", "компьютер", "конструктор",
            "конструкция", "контроль", "конфигурация", "конфиденциальность", "координата", "координаты", "копирование", "копия", "копьё", "корабль",
            "космодром", "космология", "космонавт", "космос", "кран", "куб", "кэш", "лаборант", "лаборатория", "лазер",
            "легирование", "логика", "локация", "лук", "луч", "лёд", "масса", "масштаб", "математик", "машина",
            "место", "метеор", "метеорит", "метеостанция", "метод", "механизм", "меч", "микроволновка", "микроскоп", "микросхема",
            "минута", "множество", "мобильность", "моделирование", "модель", "модем", "модернизация", "модификация", "модуль", "молекула",
            "молот", "монитор", "мощность", "музыка", "мусор", "мутация", "мысль", "мышление", "наблюдение", "наковальня",
            "напряжение", "насос", "наука", "нахождение", "нейросеть", "нейтрализатор", "нейтрино", "нейтрон", "ноутбук", "обеспечение",
            "обзор", "облако", "обновление", "обработка", "обработчик", "обсерватория", "объединение", "объект", "операция", "описание",
            "опровержение", "оптика", "оптимизация", "орбита", "оружие", "освещение", "основа", "основание", "осциллограф", "отключение",
            "отладка", "отрезок", "отчёт", "охлаждение", "охрана", "очищение", "ошибка", "палеонтолог", "палеонтология", "память",
            "папка", "параметр", "параметры", "пароль", "патент", "патрон", "передача", "перезагрузка", "пересечение", "пиксель",
            "пилот", "пистолет", "плазма", "план", "планета", "планирование", "планшет", "пластмасса", "платформа", "поглощение",
            "подключение", "подтверждение", "поиск", "пользователь", "помещение", "порох", "порт", "построение", "поток", "практика",
            "праща", "предложение", "предположение", "пресс", "прессование", "прибор", "призма", "приложение", "принтер", "притяжение",
            "прицел", "причина", "провайдер", "программа", "программирование", "проект", "проектирование", "проектор", "производительность", "прокси",
            "протеин", "протокол", "протон", "профиль", "процесс", "процессор", "прямая", "прямоугольник", "публицист", "пуля",
            "работа", "радар", "радиация", "радио", "радиоактивность", "радиолокатор", "радиометр", "развитие", "разделение", "разложение",
            "размер", "разогрев", "разработка", "разрешение", "ракета", "расхождение", "расширение", "реакция", "реальность", "регистратор",
            "регистрация", "редактирование", "редактор", "ресивер", "ресурс", "рефлектор", "решение", "робот", "ружьё",
            "сайт", "самолёт", "сборка", "свет", "связь", "секунда", "сенсор", "сервер", "сеть", "сигнал",
            "сигнализация", "сила", "симулякр", "симуляция", "сингулярность", "синхронизация", "система", "сканер", "сканирование", "скорость",
            "скрипт", "следствие", "слежение", "слово", "слой", "смартфон", "снайпер", "созвездие", "создание", "солнце",
            "сообразительность", "спектр", "спектрометр", "спутник", "среда", "сталь", "станция", "статистика", "страница", "строение",
            "строительство", "структура", "сфера", "схема", "телескоп", "телефон", "тело", "теорема", "теоретик", "теория",
            "тепло", "терминал", "термометр", "тесла", "тест", "тестирование", "техника", "технология", "ток", "траектория",
            "трансляция", "трассировка", "треугольник", "тысячелетие", "удаление", "ум", "уравнение", "ускорение", "установка", "устойчивость",
            "устройство", "утверждение", "учёный", "файл", "факт", "физик", "физика", "фосфор", "фотограф", "фотография",
            "фотометр", "фотон", "фрактал", "функции", "функционал", "функция", "футуролог", "хакер", "химия", "холодильник",
            "хранение", "хранилище", "хронограф", "хронология", "цифра", "цифровизация", "час", "частота", "часы", "чертёж",
            "число", "чугун", "шар", "шифр", "штамповка", "эволюция", "экран", "эксперимент", "электричество", "электрон",
            "эмулятор", "энергия", "ядро",
            "ДНК", "РНК"
        )

        val fantasticWords = mutableListOf(
            "абсолют", "алхимик", "алхимия", "ангел", "андроид", "аннигиляция", "антигравитация", "антиутопия", "апокалипсис", "аппарат",
            "армагеддон", "артефакт", "астероид", "астрал", "астронавт", "бездна", "бесконечность", "бессмертие", "биомеханизм", "вакуум",
            "вампир", "ведьма", "вечность", "волна", "волшебник", "волшебство", "восстание", "вселенная", "вторжение",
            "галактика", "гибрид", "гидра", "гипердвигатель", "гиперкуб", "гиперпространство", "гиперреальность", "гипноз", "гном", "гоблин",
            "голем", "голограмма", "горгулья", "гравитация", "гравицаппа", "грифон", "двигатель", "дворф", "дезинтегратор", "демон",
            "доминатор", "дракон", "дух", "единорог", "жнец", "завоевание", "завоеватель", "загадка", "заговор", "заклинание",
            "звезда", "звездолёт", "зелье", "зеркало", "излучение", "иллюзия", "имплант", "инженер", "инопланетянин",
            "интеллект", "квазар", "квант", "кибернетика", "киберпанк", "киборг", "клон", "клонирование", "колонизация", "колония",
            "комета", "континуум", "контроль", "корабль", "космодром", "космонавт", "космос", "кристалл", "круг",
            "лазер", "левитация", "маг", "магия", "манипулятор", "матрица", "метавселенная", "метафизика", "мидихлорианы", "мимик",
            "мистика", "митохондрия", "монолит", "мультивселенная", "мультипаспорт", "мутант", "наноботы", "невидимость", "нейроимплант", "нейрон",
            "нейросеть", "нейрошлем", "нейтрино", "нейтрон", "некромант", "некромантия", "оборотень", "обсерватория", "объект",
            "орден", "орк", "основание", "парадокс", "пилот", "плазма", "планета", "поле", "портал",
            "потустороннее", "предел", "привидение", "призма", "призрак", "пророчество", "пустота", "разум", "ракета", "распад",
            "реактор", "репликатор", "ретранслятор", "ретрофутуризм", "робот", "русалка", "сверхновая", "сверхскорость", "сверхъестественное", "свет",
            "сила", "симулякр", "симуляция", "сингулярность", "система", "сканер", "созвездие", "создатель",
            "сознание", "спутник", "стимпанк", "тайна", "телепортация", "тени", "термодинамика", "терраформирование", "техника",
            "технократия", "технологии", "технология", "тотем", "трансформация", "тролль", "туманность", "утопия", "фантастика", "феникс",
            "флуктуация", "футуризм", "фэнтези", "хаос", "хоббит", "хроника", "чародей", "червоточина", "чип", "чипирование",
            "экзоскелет", "экспансия", "эксперимент", "эликсир", "эльф", "энергия", "энт", "энтропия", "эфир",
            "ИИ", "НЛО", "внеземной разум", "край Вселенной", "параллельная Вселенная", "световая скорость", "сфера Дайсона",
            "чёрная дыра", "световой меч", "лазерный меч"
        )


        val selectedWords = mutableListOf<String>()
        selectedWords.addAll(natureWords)
        selectedWords.addAll(socialWords)
        selectedWords.addAll(technologyWords)
        selectedWords.addAll(fantasticWords)

        binding.toggleNature.setOnCheckedChangeListener { _, isChecked ->
            if (isChecked) {
                selectedWords.addAll(natureWords)
            } else {
                selectedWords.removeAll(natureWords)
            }
        }

        binding.toggleSocial.setOnCheckedChangeListener { _, isChecked ->
            if (isChecked) {
                selectedWords.addAll(socialWords)
            } else {
                selectedWords.removeAll(socialWords)
            }
        }

        binding.toggleTechnology.setOnCheckedChangeListener { _, isChecked ->
            if (isChecked) {
                selectedWords.addAll(technologyWords)
            } else {
                selectedWords.removeAll(technologyWords)
            }
        }

        binding.toggleFantastic.setOnCheckedChangeListener { _, isChecked ->
            if (isChecked) {
                selectedWords.addAll(fantasticWords)
            } else {
                selectedWords.removeAll(fantasticWords)
            }
        }


        // Обработчик для генерации случайного слова
        generateWordButton.setOnClickListener {
            if (selectedWords.isNotEmpty()) {                       // Если есть доступные слова, генерируем случайное
                val randomIndex = selectedWords.indices.random()    // Получаем случайный индекс
                val randomWord = selectedWords[randomIndex]       // Получаем слово по индексу
                selectedWords.removeAt(randomIndex)               // Удаляем слово по индексу
                randomWordText.text = randomWord.replaceFirstChar { it.uppercase() }

                // Запуск таймера
                if (binding.timerToggle.isChecked) {
                    startTimer()
                } else {
                    countDownTimer?.cancel()
                    binding.timerTextView.text = ""
                }
            } else {
                // val count = relationshipWords.size
                randomWordText.text = "Нет слов.."

                countDownTimer?.cancel()
                binding.timerTextView.text = ""
            }
        }
    }
}

