package ru.sapiapps.randomword

import android.os.Bundle
import androidx.activity.ComponentActivity
import ru.sapiapps.randomword.databinding.ActivityMainBinding
import android.os.CountDownTimer
import android.widget.ToggleButton

class MainActivity : ComponentActivity() {
    private lateinit var binding: ActivityMainBinding

    // Переменная для таймера
    private var countDownTimer: CountDownTimer? = null

    // Запуск таймера
    private fun startTimer() {
        val timerTextView = binding.timerTextView // Ссылка на TextView для таймера

        // Отмена предыдущего таймера, если он запущен
        countDownTimer?.cancel()

        // Создаём новый таймер на 15 секунд (Поставлю +1 секунду, чтобы вначале отображалось 15)
        countDownTimer = object : CountDownTimer(16000, 1000) { // 15000 мс = 15 секунд
            override fun onTick(millisUntilFinished: Long) {
                // Обновляем текст таймера каждую секунду
                timerTextView.text = (millisUntilFinished / 1000).toString()
            }

            override fun onFinish() {
                // Когда таймер завершился
                timerTextView.text = "0"
            }
        }.start()
    }


    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)

        // Подключаем ViewBinding
        binding = ActivityMainBinding.inflate(layoutInflater)
        setContentView(binding.root)

        // Инициализация и работа с элементами
        val randomWordText = binding.randomWordText
        val generateWordButton = binding.generateWordButton

        // Списки слов
        val natureWords = mutableListOf(
            "абрикос", "август", "авокадо", "агава", "аист", "айсберг", "акация", "акула", "аллея", "альбатрос",
            "альпака", "амбар", "амфибия", "ананас", "апрель", "арахис", "арбуз", "арктика", "бабочка", "баклажан",
            "бактерия", "бамбук", "банан", "баран", "барс", "батат", "белка", "белуга", "берег", "беркут",
            "берлога", "берёза", "бобёр", "болото", "бор", "броненосец", "брусника", "буйвол", "букашка", "буревестник",
            "бык", "василёк", "век", "весна", "ветер", "ветка", "викунья", "вино", "виноград", "вихрь",
            "вода", "водоросль", "водоём", "волк", "воробей", "ворон", "ворона", "восток", "вулкан", "выживание",
            "вьюга", "вьюн", "гагара", "гардения", "гвоздика", "геккон", "гепард", "год", "голубика", "голубь",
            "гора", "горох", "град", "гранат", "гриб", "грибница", "грибок", "гром", "грунт", "груша",
            "грязь", "гумус", "гусеница", "декабрь", "дельфин", "дерево", "джунгли", "дикий", "дождь", "долгота",
            "дорога", "дуб", "дым", "дыня", "ежевика", "ель", "жаба", "жара", "жасмин", "жатва",
            "животное", "жизнь", "жимолость", "жираф", "жук", "закат", "запад", "зарево", "заря", "заяц",
            "зверь", "звёзды", "зебра", "земля", "зима", "змея", "имбирь", "индейка", "индюк", "иней",
            "июль", "июнь", "кабан", "казуар", "кактус", "календула", "калина", "камень", "камнепад", "камыш",
            "капибара", "капля", "карп", "картофель", "каштан", "кедр", "кенгуру", "кешью", "киви", "кит",
            "китоглав", "клубника", "клюква", "клён", "коала", "кокос", "конь", "коралл", "корень", "корова",
            "коряга", "костёр", "кот", "кочка", "кошка", "краб", "крапива", "креветка", "крокодил", "кролик",
            "крот", "крыжовник", "кувшинка", "кузнечик", "кукушка", "курица", "куст", "кустраник", "лава", "лаванда",
            "лама", "ландыш", "лебедь", "лев", "ледник", "леопард", "лес", "лето", "лиана", "лилия",
            "липа", "лиса", "лисица", "лиственница", "листок", "лишай", "лосось", "лось", "лотос", "лошадь",
            "лужа", "лук", "луна", "лягушка", "лёд", "лён", "май", "мак", "малина", "манго",
            "мандарины", "маракуйя", "март", "мгла", "медведь", "мелодия", "месяц", "метель", "мираж", "можжевельник",
            "молния", "молодость", "море", "морж", "морковь", "мороз", "морошка", "морской", "мотыга", "мох",
            "мука", "муравей", "насекомое", "небо", "ночь", "ноябрь", "обезьяна", "облепиха", "обряд", "овца",
            "огонь", "огурец", "озеро", "океан", "октябрь", "олень", "оливка", "опасность", "орех", "орхидея",
            "орёл", "осень", "осина", "осока", "осьминог", "осётр", "отлив", "палатка", "палка", "пальма",
            "панда", "папайя", "парк", "паук", "паутина", "пеликан", "первобытный", "перец", "перловка", "перо",
            "персик", "песня", "песок", "пещера", "пингвин", "пион", "пиранья", "пихта", "пламя", "племя",
            "плотина", "побережье", "погода", "подберёзовик", "подосиновик", "подсолнух", "пожар", "полночь", "полынь", "поляна",
            "поплавок", "попугай", "популяция", "поросль", "посох", "прибой", "природа", "просо", "пруд", "птица",
            "пума", "пустыня", "пшеница", "пёс", "радужка", "разлив", "ракушка", "рассвет", "редис", "река",
            "рис", "рожь", "роза", "ромашка", "роса", "рукола", "рыба", "рысь", "рябина", "саванна",
            "саженец", "сакура", "саламандра", "свет", "светило", "север", "седина", "село", "сельдерей", "семена",
            "семечко", "сентябрь", "серпантин", "сеть", "сирень", "скат", "скворец", "скворечник", "слива", "смородина",
            "снег", "снегирь", "снегопад", "сова", "сойка", "солнце", "соловей", "сорока", "сосна", "спрут",
            "старость", "стебель", "степь", "стерлядь", "страус", "стружка", "сумерки", "сурок", "суслик", "тайга",
            "тайфун", "тепло", "тигр", "тина", "томаты", "тополь", "топот", "торнадо", "тропа", "труд",
            "трясина", "тукан", "туман", "тундра", "тунец", "тьма", "тюльпан", "удило", "удобрение", "удочка",
            "ураган", "утка", "утёс", "факел", "фасоль", "фауна", "февраль", "филин", "фисташки", "фламинго",
            "флора", "фундук", "хвоя", "хлопок", "холм", "холод", "цапля", "цветок", "цветы", "циклон",
            "цунами", "чайка", "чаща", "человек", "червь", "черемша", "черешня", "черника", "чеснок", "чешуя",
            "чистотел", "шалфей", "шампиньон", "шелкопряд", "широта", "шишка", "шмель", "шпинат", "шторм", "шёлк",
            "щавель", "щука", "эвкалипт", "эволюция", "эль", "юг", "яблоко", "яблоня", "ягода", "январь",
            "ясень", "ястреб", "ячмень", "ящер", "ящерица", "ёж", "ёжик", "ёлка"
        )

        val socialWords = mutableListOf(
            "авторитет", "агент", "адвокат", "адекватность", "аккаунт", "активность", "акция", "альянс", "анализ", "ассортимент",
            "аттестация", "аудитория", "баланс", "барьер", "безопасность", "беседа", "бизнес", "благо", "благодарность", "близкие",
            "близость", "богатство", "бюджет", "вдохновение", "вера", "взаимность", "взаимовыручка", "взаимодействие", "взаимопомощь", "взаимопонимание",
            "взаимосвязь", "взгляды", "влияние", "внимание", "возможность", "возмущение", "волнение", "воспоминание", "восстановление", "востребованность",
            "восхищение", "враг", "вред", "встреча", "выбор", "выгода", "выражение", "гарантия", "гармония", "гладкость",
            "глобализация", "голос", "гордость", "горе", "город", "господство", "государство", "гражданство", "группа", "грусть",
            "дело", "деятельность", "диалог", "диведенды", "дивиденд", "дискуссия", "добро", "доброта", "доверие", "договор",
            "документ", "долг", "должность", "дом", "доставка", "доход", "друг", "дружба", "дружелюбие",
            "дружеский", "друзья", "душевность", "единство", "жертвенность", "забота", "заказ", "закон", "законодательство", "замысел",
            "заработок", "заслуга", "защита", "заявка", "заявление", "здравоохранение", "зло", "злость", "знакомство", "знание",
            "идентификация", "извинение", "инвестирование", "инициатива", "инновация", "интерес", "интуиция", "инфраструктура", "искренность", "история",
            "капитал", "карма", "карьера", "квартира", "клиент", "коллектив", "команда", "коммерция", "коммуникация", "компания",
            "компромисс", "комфорт", "консул", "консультант", "консультация", "контакт", "контракт", "контроль", "конфликт", "кооперация",
            "король", "корпоративный", "корпорация", "кредо", "культура", "лидер", "лидерство", "лицензия", "логика", "логистика",
            "лояльность", "любовь", "любопытство", "лёгкость", "манипуляция", "маркетинг", "мегаполис", "менеджмент", "механизм", "милосердие",
            "мир", "мнение", "мониторинг", "мотив", "мудрость", "навык", "награда", "надежда", "налог", "налоги",
            "намерение", "народ", "наследие", "наука", "недвижимость", "недоброжелатель", "нежность", "независимость", "нужда", "обещание",
            "облигация", "обмен", "образование", "обсуждение", "общение", "общество", "объединение", "объятие", "объятия", "обязанности",
            "обязанность", "озабоченность", "опека", "опыт", "организация", "ориентир", "осознание", "ответственность", "отдача", "отзыв",
            "откровенность", "открытость", "отношения", "отчаяние", "ощущение", "память", "партия", "партнёр", "переговоры", "переживать",
            "платформа", "поддержание", "поддержка", "подруга", "пожелания", "позиция", "поиск", "покой", "покорность", "покровительство",
            "политика", "польза", "помощь", "понимание", "поселенец", "поселение", "поступок", "право", "преданность", "президент",
            "прибыль", "привязанность", "признание", "примирение", "принцип", "приоритет", "пристав", "пристрастие", "прогресс", "продвижение",
            "проект", "производство", "прорыв", "профессионал", "профессионализм", "прощение", "публикация", "путь", "радость", "радушие",
            "развитие", "разговор", "разделение", "разочарование", "разрешение", "расставание", "реакция", "реализация", "ревизия", "резидент",
            "рейтинг", "ресурс", "ресурсы", "решение", "риск", "родные", "родственники", "роль", "рынок", "самоотдача",
            "самореализация", "свобода", "связь", "сделка", "семья", "сентиментальность", "сервис", "сила", "система", "слабость",
            "слушание", "смирение", "совместимость", "согласие", "согласование", "соглашение", "сожаление", "сообщение", "сопереживание", "сопротивление",
            "состояние", "сострадание", "сотрудник", "сотрудничество", "сохранение", "социум", "сочувствие", "союз", "сплочённость", "спокойствие",
            "спрос", "средства", "стабильность", "стандарт", "столица", "страдания", "страна", "страсть", "стратегия", "структура",
            "субсидия", "суд", "сфера", "счастье", "тактика", "тактичность", "тариф", "теплота", "терпимость", "технологии",
            "технология", "традиция", "тренд", "трусость", "туризм", "тяготение", "уважение", "увековечение", "угроза", "удовлетворение",
            "удовольствие", "улыбка", "умиротворение", "управление", "уравновешенность", "услуга", "успех", "устойчивость", "уступка", "уход",
            "участие", "учёт", "факт", "финансирование", "финансы", "фирма", "функция", "царь", "цель", "ценность",
            "центр", "цикл", "человечность", "честность", "чувствительность", "чувство", "шаг", "шанс", "экономика", "эксперт",
            "эмоции", "эмпатия", "эффективность", "юрист"
        )

        val technologyWords = mutableListOf(
            "алгебра", "алгоритм", "алгоритмизация", "анализ", "анализатор", "андроид", "антенна", "антивирус", "аппарат", "архив",
            "архиватор", "архитектура", "астероид", "астробиолог", "астрономия", "астрофизик", "атмосфера", "база", "байт", "барометр",
            "бинокль", "биолог", "бит", "битрейт", "бозон", "браузер", "веб", "вебсайт", "видеозапись", "видеокамера",
            "визуализация", "виртуальный", "вкладка", "вопрос", "вселенная", "вход", "выход", "вычисления", "гаджет", "галактика",
            "геометрия", "гравитация", "график", "данные", "дебаг", "детектор", "диаграмма", "дисплей", "доклад", "документ",
            "доступ", "драйвер", "дрон", "запись", "запуск", "защита", "звезда", "игра", "излучатель", "измеритель",
            "изобретатель", "изобретение", "изучение", "ИИ", "инженер", "инсталляция", "интернет", "интерфейс", "интерферометр", "информатика",
            "информация", "исследование", "исследователь", "источник", "калькулятор", "камера", "карта", "катализатор", "каталог", "квант",
            "клавиатура", "класс", "код", "кодировка", "команда", "комета", "компас", "компиляция", "комплекс", "компьютер",
            "контроль", "конфигурация", "конфиденциальность", "копирование", "копия", "космодром", "космология", "космонавт", "космос", "кэш",
            "лаборатория", "лазер", "логика", "локация", "масштаб", "математик", "метеор", "метеорит", "метеостанция", "метод",
            "механизм", "микроскоп", "мобильность", "моделирование", "модель", "модем", "модернизация", "модификация", "модуль", "монитор",
            "наблюдение", "наука", "нейросеть", "ноутбук", "обеспечение", "обзор", "облако", "обновление", "обработка", "обработчик",
            "обратная", "обсерватория", "объект", "операция", "оптика", "оптимизация", "орбита", "основа", "основание", "осциллограф",
            "отключение", "отладка", "отчёт", "палеонтолог", "память", "папка", "параметр", "параметры", "передача", "перезагрузка",
            "пилот", "планета", "планирование", "планшет", "платформа", "подключение", "пользователь", "порт", "поток", "прибор",
            "призма", "приложение", "принтер", "провайдер", "программа", "программирование", "проект", "проектирование", "проектор", "производительность",
            "прокси", "протокол", "профиль", "процессор", "работа", "радар", "радио", "радиолокатор", "радиометр", "разделение",
            "размер", "разработка", "разрешение", "расширение", "регистратор", "редактирование", "ресивер", "ресурс", "рефлектор", "робот",
            "сайт", "сборка", "связь", "секунда", "сенсор", "сервер", "сеть", "сигнал", "сигнализация", "симулякр",
            "симуляция", "сингулярность", "синхронизация", "система", "сканер", "сканирование", "скорость", "скрипт", "слой", "смартфон",
            "созвездие", "создание", "солнечный", "спектр", "спектрометр", "спутник", "среда", "статистика", "страница", "структура",
            "схема", "телескоп", "телефон", "теоретик", "терминал", "термометр", "тест", "тестирование", "техника", "технология",
            "траектория", "трансляция", "трассировка", "удаление", "ускорение", "установка", "устройство", "учёный", "файл", "физик",
            "физика", "фотограф", "фотометр", "фотон", "функционал", "функция", "футуролог", "хакер", "химия", "хронограф",
            "хронология", "цифра", "цифровизация", "чертёж", "число", "экран", "эксперимент", "электричество", "эмулятор"
        )

        val fantasticWords = mutableListOf(
            "абсолют", "алхимик", "алхимия", "ангел", "андроид", "аннигиляция", "антигравитация", "антиутопия", "апокалипсис", "аппарат",
            "армагеддон", "артефакт", "астероид", "астрал", "астронавт", "бездна", "бесконечность", "бессмертие", "биомеханизм", "вакуум",
            "вампир", "ведьма", "вечность", "виртуальный", "волшебник", "волшебство", "вселенная", "галактика", "гибрид", "гидра",
            "гипердвигатель", "гиперкуб", "гиперпространство", "гиперреальность", "гипноз", "гном", "гоблин", "голем", "голограмма", "горгулья",
            "гравитация", "гравицаппа", "грифон", "двигатель", "дворф", "дезинтегратор", "демон", "доминатор", "дракон", "дух",
            "единорог", "жнец", "завоеватель", "загадка", "заговор", "заклинание", "звезда", "звездолёт", "зелье", "зеркало",
            "ИИ", "иллюзия", "имплант", "инженер", "инопланетянин", "квазар", "квант", "квантовый", "киберпанк", "киборг",
            "клон", "клонирование", "комета", "континуум", "корабль", "космический", "космос", "кристалл", "круг", "лазер",
            "левитация", "маг", "магия", "матрица", "метавселенная", "метафизика", "мидихлорианы", "мимик", "митохондрии", "монолит",
            "мультивселенная", "мультипаспорт", "мутант", "наноботы", "неведомое", "невидимость", "неземное", "нейроимплант", "нейрон", "нейросеть",
            "нейрошлем", "нейтрон", "некромант", "некромантия", "оборотень", "обсерватория", "объект", "орден", "орк", "парадокс",
            "параллельная", "песчаный", "пилот", "плазма", "планета", "поле", "портал", "потустороннее", "привидение", "призма",
            "призрак", "пророчество", "пустота", "ракета", "распад", "реактор", "репликатор", "ретранслятор", "робот", "русалка",
            "сверхновая", "сверхскорость", "сверхъестественное", "световой меч", "сила", "симулякр", "симуляция", "сингулярность", "система", "сканер",
            "созвездие", "спутник", "стимпанк", "сфера Дайсона", "телепортация", "тени", "термодинамика", "терраформирование", "тотем", "трансформация",
            "тролль", "туманность", "утопия", "феникс", "флуктуация", "хаос", "хоббит", "хроника", "чародей", "червоточина",
            "экзоскелет", "экспансия", "эксперимент", "эликсир", "эльф", "энергия", "энт", "энтропия", "эфир"
        )


        val selectedWords = mutableListOf<String>()
        selectedWords.addAll(natureWords)
        selectedWords.addAll(socialWords)
        selectedWords.addAll(technologyWords)
        selectedWords.addAll(fantasticWords)

        binding.toggleNature.setOnCheckedChangeListener { _, isChecked ->
            if (isChecked) {
                selectedWords.addAll(natureWords)
            } else {
                selectedWords.removeAll(natureWords)
            }
        }

        binding.toggleSocial.setOnCheckedChangeListener { _, isChecked ->
            if (isChecked) {
                selectedWords.addAll(socialWords)
            } else {
                selectedWords.removeAll(socialWords)
            }
        }

        binding.toggleTechnology.setOnCheckedChangeListener { _, isChecked ->
            if (isChecked) {
                selectedWords.addAll(technologyWords)
            } else {
                selectedWords.removeAll(technologyWords)
            }
        }

        binding.toggleFantastic.setOnCheckedChangeListener { _, isChecked ->
            if (isChecked) {
                selectedWords.addAll(fantasticWords)
            } else {
                selectedWords.removeAll(fantasticWords)
            }
        }


        // Обработчик для генерации случайного слова
        generateWordButton.setOnClickListener {
            if (selectedWords.isNotEmpty()) {                       // Если есть доступные слова, генерируем случайное
                val randomIndex = selectedWords.indices.random()    // Получаем случайный индекс
                val randomWord = selectedWords[randomIndex]       // Получаем слово по индексу
                selectedWords.removeAt(randomIndex)               // Удаляем слово по индексу
                randomWordText.text = randomWord.replaceFirstChar { it.uppercase() }

                // Запуск таймера
                if (binding.timerToggle.isChecked) {
                    startTimer()
                } else {
                    countDownTimer?.cancel()
                    binding.timerTextView.text = ""
                }
            } else {
                // val count = relationshipWords.size
                randomWordText.text = "Нет слов.."

                countDownTimer?.cancel()
                binding.timerTextView.text = ""
            }
        }
    }
}

